const steps = [
  '规划进度管理',
  '定义活动',
  '排列活动顺序',
  '估算活动资源',
  '估算活动持续时间',
  '制定进度计划',
  '控制进度',
];

const infos = [
  [
    {
      name: '概念',
      content: [
        '为实施项目进度管理制定政策、程序，并形成文档化的项目进度管理计划的过程',
      ],
    },
    {
      name: '作用',
      content: ['在整个项目过程中为管理、执行和控制项目进度提供指南和方向'],
    },
    {
      name: '输入',
      content: ['项目管理计划', '项目章程', '组织过程资产', '事业环境因素'],
    },
    { name: '工具与技术', content: ['专家判断', '分析技术', '会议'] },
    { name: '输出', content: ['项目进度管理计划'] },
  ],
  [
    {
      name: '概念',
      content: [
        '活动概念：WBS中最底层的工作包',
        '定义活动：识别和记录为完成项目可交付成果而需采取的所有活动',
      ],
    },
    {
      name: '输入',
      content: ['进度管理计划', '范围基准', '组织过程资产', '事业环境因素'],
    },
    { name: '工具与技术', content: ['分解', '滚动式规划', '专家判断'] },
    { name: '输出', content: ['活动清单', '活动属性', '里程碑清单'] },
    {
      name: '滚动式规划',
      content: [
        '一种渐进明细的规划方式，即对近期要完成的工作进行详细规划，而对远期工作，信息尚不明确，则暂时只在WBS的较高层次上进行粗略规划，随着了解到更多的信息，再分解成具体的活动',
      ],
    },
  ],
  [
    {
      name: '概念',
      content: [
        '识别和记录项目活动之间的关系的过程，定义工作之间的逻辑顺序，以便在既定的所有项目制约因素下获得最高的效率',
      ],
    },
    {
      name: '输入',
      content: [
        '进度管理计划',
        '活动清单',
        '活动属性',
        '里程碑清单',
        '项目范围说明书',
        '事业环境因素',
        '组织过程资产',
      ],
    },
    {
      name: '工具与技术',
      content: ['前导图法', '箭线图法', '确定依赖关系', '提前量与滞后量'],
    },
    { name: '输出', content: ['项目进度网络图', '项目文件更新'] },
    {
      name: '前导图法',
      content: [
        '使用方法：方框或者长方形（称作节点）代表活动，节点之间用箭头连接，以显示节点之间的逻辑关系',
        '',
        '',
        '',
      ],
    },
    { name: '箭线图法', content: [] },
    { name: '提前量', content: [] },
    { name: '滞后量', content: [] },
  ],
  [],
  [],
  [],
  [],
];
// {name: '', content: []},

const title = '项目范围管理';

export default [steps, infos, title];
